


extern float  FILTR_REG[] ;

double A0, A1, A2, B0, B1, B2, A20, A21, A22, B20, B21, B22, A30, A31, A32, B30, B31, B32,
	   G1, G2, G3, GO,
		out_1_x[3], out_1_y[3], out_1_z[3],
		out_2_x[3], out_2_y[3], out_2_z[3],
	  	out_3_x[3], out_3_y[3], out_3_z[3], out_filtr[3],

        work_data_x[3], work_data_y[3], work_data_z[3];

 void init_koaffic(void) // задание коеффициентов фильтра
						 // Фильтр Баттерворта 
////////////////////////////////////////////////////////////////////////////////////////
// Фильтр реализован в виде последовательного соединения секций второго порядка 
// для ФНЧ и ФВЧ .
// Выходной сигнал фильтра второго порядка (секции) можно записать  (при a0=1):

// y(n)=( b0*x(n)+b1*x(n-1)+b2*x(n-2) ) – ( a1*y(n-1) + a2*y(n-2) )

// Этот сигнал будет входным для следующей секции.
/////////////////////////////////////////////////////////////////////////////////////////

 
 // /*
{	  // БИХ Фильтр Баттерворта ФВЧ 6 порядка : Fd = 25 Hz Fs = 0,02Hz

	B0 =	1.00;
	B1 =	-2.0;
	B2 =    1.0;
  	A0 =	1.0;
	A1 =	-1.9903112704486374;
	A2 =	0.99033641450198262;		  // Первая секция
	G1 = 	0.000025144053345194092;
	
	B20 =	1.00;
	B21 =	-2.0;
	B22 =   1.00;
	A20 =	1.0;
	A21 =	-1.9973762254167331;		  // Вторая секция
	A22 =	0.99740145872325514;
	G2 = 	0.99922695563345498;

	B30 =	1.00;
	B31 =	-2.0;
	B32 =   1.0;
	A30 =	1.0;
	A31 =	-1.9928914170744694;		  // Третья секция
	A32 =	0.99291659372339158;
	G3 =   1.0;
	GO =   39416.978218011805;
	
}

//	*/
	

void filtr(void) {			//Время расчёта 13 мкс

	 	// подготовка входных данных
	work_data_x[0] = work_data_x[1]; work_data_x[1] = work_data_x[2]; work_data_x[2] = data_X[kk-1] * G1;
	work_data_y[0] = work_data_y[1]; work_data_y[1] = work_data_y[2]; work_data_y[2] = data_Y[kk-1] * G1;
	work_data_z[0] = work_data_z[1]; work_data_z[1] = work_data_z[2]; work_data_z[2] = data_Z[kk-1] * G1;

	   // расчет выхода первой секции
	out_1_x[2] = (B0 * work_data_x[2] + B1 * work_data_x[1] + B2 * work_data_x[0])-(A1 * out_1_x[1] + A2 * out_1_x[0]) ;
	out_1_y[2] = (B0 * work_data_y[2] + B1 * work_data_y[1] + B2 * work_data_y[0])-(A1 * out_1_y[1] + A2 * out_1_y[0]) ;
	out_1_z[2] = (B0 * work_data_z[2] + B1 * work_data_z[1] + B2 * work_data_z[0])-(A1 * out_1_z[1] + A2 * out_1_z[0]) ;

	   // расчет выхода второй секции
	out_2_x[2] = (B20 * out_1_x[2]*G2 + B21 * out_1_x[1] + B22 * out_1_x[0])-(A21 * out_2_x[1] + A22 * out_2_x[0]) ;
	out_2_y[2] = (B20 * out_1_y[2]*G2 + B21 * out_1_y[1] + B22 * out_1_y[0])-(A21 * out_2_y[1] + A22 * out_2_y[0]) ;
	out_2_z[2] = (B20 * out_1_z[2]*G2 + B21 * out_1_z[1] + B22 * out_1_z[0])-(A21 * out_2_z[1] + A22 * out_2_z[0]) ;

 		// расчет выхода третьей секции	- выход после цифрового фильтра
	out_3_x[2] = (B30 * out_2_x[2]*G3 + B31 * out_2_x[1] + B32 * out_2_x[0])-(A31 * out_3_x[1] + A32 * out_3_x[0]) ;
	out_3_y[2] = (B30 * out_2_y[2]*G3 + B31 * out_2_y[1] + B32 * out_2_y[0])-(A31 * out_3_y[1] + A32 * out_3_y[0]) ;
	out_3_z[2] = (B30 * out_2_z[2]*G3 + B31 * out_2_z[1] + B32 * out_2_z[0])-(A31 * out_3_z[1] + A32 * out_3_z[0]) ;


    out_1_x[0] = out_1_x[1]; out_1_x[1] = out_1_x[2];
    out_1_y[0] = out_1_y[1]; out_1_y[1] = out_1_y[2];	 //сдвигаю данные
    out_1_z[0] = out_1_z[1]; out_1_z[1] = out_1_z[2];

	out_2_x[0] = out_2_x[1]; out_2_x[1] = out_2_x[2];
    out_2_y[0] = out_2_y[1]; out_2_y[1] = out_2_y[2];	 //сдвигаю данные
    out_2_z[0] = out_2_z[1]; out_2_z[1] = out_2_z[2];

	out_3_x[0] = out_3_x[1]; out_3_x[1] = out_3_x[2];
    out_3_y[0] = out_3_y[1]; out_3_y[1] = out_3_y[2];	 //сдвигаю данные и умножаю на
    out_3_z[0] = out_3_z[1]; out_3_z[1] = out_3_z[2];	 

	       out_filtr[0]	= out_3_x[1]*GO;				// умножаю на
		   out_filtr[1]	= out_3_y[1]*GO;				// выходной коэффициент
 		   out_filtr[2]	= out_3_z[1]*GO;				   


}
