t <html><head><title>Управление памятью</title>
i pg_header.inc
t <h2 align=center><br>Управление памятью</h2>
t <p><font size="2">Карта памяти предназначена для временного сохранения регистрируемой<br>
t  информации в случае потери связи с ОВЦ. Информция сохраняется в папках фиксированной длины.<br>
t  Каждая папка содержит информацию за 1 час времени.<br>
t  Считывание файлов происходит автоматически, после восстановления связи с ОВЦ. <br><br>
t <p><a href="../dir.cgi"><b><font size="4">Просмотреть папки</font></b></a></p>
t <p><a href="../format.cgi"><b><font size="4">Форматировать память</font></b></a></p>
. End of script must be closed with period.

